var plants = 
{"salvia": 
	{"names": ["Diviner's Sage","Ska María Pastora", "Seer's Sage", "Salvia"],
	 "species": "Salvia divinorum",
	 "short_desc": "This Mexican sage has leaves that are smoked or chewed.",
	 "long_desc": "Contains the drug <em>salvinorin-A</em>, an extremely potent hallucinongen that causes psychoactive experiences lasting from several minutes to an hour. It also causes diarrhea.",
	 "testimonials":[
	  	"<p>Two hours after you smoke this plant, you think your entire body has exploded into tiny fragments.<p>There is no more you… just terribly painful forces that rip through your body and tear you to pieces.<p>You watch in horror as your body fluids splash onto the floor, and your organs tumble away. Your fingers and toes grow wrinkled faces with toothless smiles that laugh at you and glassy eyes that leer at you.<p>You are paranoid for weeks after."
 		,"<p>One hour after smoking the plant, the colors and sensations that surround you become harsh and violent. You are sure you have been kidnapped by an alien race that has trapped your mind in a jar and cut up your body in front of you. <p>You are begging for someone to help you - the neighbors have the police come get you.<p>Three days later, you feel like something is still missing from your brain and you are hearing whispering."
 		,"<p>After you smoke the plant, you begin pacing, scurrying and weeping for over two hours, stammering and gibbering like a lunatic, and turning on every light in the house out of fear.<p>Your vision is so horribly distorted that all solid matter seems to ooze like runny eggs. You go in circles, babbling, stretching your brow and forehead and eyeballs and tear deep scratches in your elbows and ankles trying to pull off the orange fluff that coats your body.<p>You stay awake for two nights swatting away dead relatives and nursing your cuts."
 		]
	},
 "kratom": {
 	"names": ["Kratom"],
 	"species": "Mitragyna speciosa korth",
 	"short_desc": "This Asian tree has leaves that are chewed or made into tea.",
 	"long_desc": "Though it is being studied for its treatment of anxiety, depression, and even opiate addiction, Kratom also has risky side effects. Among them are anorexia, insomnia, and addiction.",
 	"testimonials":[
 		"<p>This is one of the foulest drinks you have ever swallowed. <p>Your body temperature rises and you begin to sweat. <p>You feel dizzy and nauseous. You vomit and see blood-colored flying patterns. <p>After that you just have a headache and two days of constipation"
 		,"<p>You drink the bitter tea and within an hour you feel weightless and floaty. <p>You feel very relaxed and calm but have trouble keeping your eyes open. <p>Afterwards, you have a slight bit of nausea and days of constipation."
 		,"<p>An hour after you chew the leaves, you feel a bit warm and light-headed. <p>You feel like dancing but you are too nauseated and dizzy to try. The room begins spinning and you fall down in the kitchen. <p>You fall asleep on the floor, right where you fell, and wake up the next morning with a headache and constipation. <p>You realize that you forgot to feed your dog and discover that the oven has been on all night."
 	]
 	},
"yopo": {
 	"names": ["Yopo","Jopo","Cohoba","Mopo","Nopo","Parica","Calcium Tree"],
 	"species": "Anadenanthera peregrina",
 	"short_desc": "This South American tree has long brown seed pods which are used like snuff or burned.",
 	"long_desc": "Contains bufotenine, a hallucinogen. If eaten, Yopo beans cause nausea and vomiting.",
 	"testimonials": [
 		"<p>After inhaling the vapors, you start sweating and feel a bit nervous. Everything begins to swirl and the hairs on your head begin to dance. <p>You can hear faint voices shouting out numbers. You try to walk but your body just twitches and everything in the room looks like it is made of liquid. <p>You can't remember what you are doing, or why you are in the bathroom, so you go to bed and play with three little worms living in a patch of green grass growing on your upper arm. <p>Everything smells like toast the next day."
 		,"<p>After using the snuff, you begin to see a slight shimmer around objects. You feel pressure in your head and body, and unpleasant nausea for five hours. <p>The pressure, nausea, and feeling like you need to poop are irritating."
 		,"<p>Ten minutes after you put the drug under your tongue, you get nauseous and need to spit. You shut your eyes and see a bunch of dancing bugs that turn into naked babies. <p>They have beautiful wings and are singing. Their faces keep changing colors. <p>One baby comes close to you and you can see its heart beating through its chest. Suddenly he cries and blows apart into a cloud of smoke. You start to feel dizzy and open your eyes. Everything in the room is multi-colored and flashing and waving as if made of water. <p>The effects wear off fast but give you a terrible headache that lasts a few days."
 	]
 	}, 	
 "iboga": {
 	"names": ["Iboga"],
 	"species": "Tabernanthe iboga",
 	"short_desc": "This African shrub has edible roots and is banned in most all countries.",
 	"long_desc": "Contains ibogaine, a hallucinogen with varied side effects, including ataxia (a-TAX-eeya), or difficulty controlling muscle motion, as well as nausea and vomiting.",
 	"testimonials":[
 		"<p>Within thirty minutes of chewing, you begin to feel anxiety and have trouble remembering how to breathe. Then you begin to see strange animated animals. They are all very puffy and have short stubby legs with large rounded bellies. <p>Then, in the distance, you see a little mean blonde girl in a brightly colored boat. She is paddling toward you with a big red lollipop. As she rows past your head she says, \"Hello. Do you have any blue?\" and rows on by. <p>Faces and animals fly by you for a few hours, and then a woman who resembles a grasshopper comes down from above and in a very insect-like voice says, \"Water everywhere...\" For hours, you cannot walk. <p>You later wake up to find you have wet your pants."
 		,"<p>Fifteen minutes after you eat the drug, the room starts to vibrate and you begin to giggle. The people in the pictures in the room begin to tap their feet and the carpet begins breathing softly. The walls start to move in and then they explode and you are in space looking down at earth. <p>Then you are seeing dead people being sucked into tubes and you realize you are in the land of the dead where time has stopped. After the drug wears off you realize you have been staring at a blank TV. <p>You no longer have any perception of time."
 		,"<p>A half hour after taking this drug, you begin to see hundreds of gingerbread men on conveyer belts. They can all move their little fat hands and legs. Some are labeled cherry and some are labeled ham. <p>There is a row labeled ham that passes through a bright light [that] changes them all to charcoal. <p>You feel a great pain in your heart, which spreads like fire all over your body. You attempt to get some water to put the fire out but find yourself unconscious on the floor of the bathroom several hours later, never having reached the sink. <p>You are scatterbrained for a few days but feel cleansed with a desire to join a church."
 	]
 	},
 "peyote": {
 	"names": ["Peyote Cactus"],
 	"species": "Lophophora williamsii",
 	"short_desc": "This scarce, slow-growing North American cactus grows in button shapes that are eaten or made into tea.",
 	"long_desc": "Contains mescaline, a hallucinogen that intensifies and alters existing stimuli (objects and sounds).",
 	"testimonials":[
 		"<p>After you drink the tea, you try to watch a comedian but begin to feel some anxiety. <p>You change over to listening to music but the anxiety turns to fear and then illness. You spend three hours vomiting, holding onto a spinning toilet seat and then fall asleep with your head in the bowl. <p>Thankfully, you feel good the next day."
 		,"<p>An hour after you take the drug, your friends become worried and take your blood pressure. You realize a heart attack can occur at any minute! Then you think you must be dead! <p>You wonder why they allowed you to die so young… Now you can't stop laughing. You realize you cannot un-take what you took. <p>You decide to invent a new religion but before you can finish it, you can't remember why you’re doing it. You pass out and wake to foamy yellow vomit. <p>You dream of spiders that night and start feeling better."
 		,"<p>You drink the vile liquid and soon start to feel queasy. After an hour it makes you run around yelling and laughing at things that are actually not there. <p>Your shoes begin to talk to each other. You become entranced by a blue blanket and hide under it for protection from evil forces. <p>You wake up with sore stomach muscles, bad body odor, and glass shards in your feet."
 	]
 	}
 };